aditional/ValidateTokenSrvsService.wsdl.xml

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://tokenvalidation.sso.onlineservices.etisalat.ae/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://tokenvalidation.sso.onlineservices.etisalat.ae/" name="ValidateTokenSrvsService">
<types>
<xsd:schema>
<xsd:import namespace="http://tokenvalidation.sso.onlineservices.etisalat.ae/" schemaLocation="http://10.51.224.31:7003/portaluserssso/ValidateTokenSrvsService?xsd=1"/>
</xsd:schema>
</types>
<message name="validateToken">
<part name="parameters" element="tns:validateToken"/>
</message>
<message name="validateTokenResponse">
<part name="parameters" element="tns:validateTokenResponse"/>
</message>
<portType name="ValidateTokenSrvs">
<operation name="validateToken">
<input message="tns:validateToken"/>
<output message="tns:validateTokenResponse"/>
</operation>
</portType>
<binding name="ValidateTokenSrvsPortBinding" type="tns:ValidateTokenSrvs">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="validateToken">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="ValidateTokenSrvsService">
<port name="ValidateTokenSrvsPort" binding="tns:ValidateTokenSrvsPortBinding">
<soap:address location="http://10.51.224.31:7003/portaluserssso/ValidateTokenSrvsService"/>
</port>
</service>
</definitions>