aditional/Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tok="http://tokenvalidation.sso.onlineservices.etisalat.ae/">
   <soapenv:Header/>
   <soapenv:Body>
      <tok:validateToken>
         <!--Optional:-->
         <arg0>
            <!--Optional:-->
            <AdditionalInfoList>
               <!--Zero or more repetitions:-->
               <additionalInfo>
                  <!--Optional:-->
                  <name/>
                  <!--Optional:-->
                  <value/>
               </additionalInfo>
            </AdditionalInfoList>
            <requestFlag>0</requestFlag>
            <serviceAccessPassword>password</serviceAccessPassword>
            <serviceAccessUsername>username</serviceAccessUsername>
            <sourcChannel>VCPE</sourcChannel>
            <token>cust001</token>
         </arg0>
      </tok:validateToken>
   </soapenv:Body>
</soapenv:Envelope>